////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
////                                               #                        ////
////   0   0 0000  000  00000 00000 0  0    0    00000 0000 0  0 00000      ////
////   0  0  000   0  0   0   ###    00     0      0   0    0  0   0        ////
////   0 0   0     000    0   00     00     0      0   0 #0 0000   0        ////
////   00    0000  0  0   0   00000 0  0    0000 00000 0000 0  0   0        ////
////                                                                        ////
////   P L U G I N  for Omega Engine                                        ////
////                                                                        ////
////   Plugin Version : 0.9                                                 ////
////   Engine Version : 0.8 Preview's and higher :)                         ////
////   webpage        : http://www.isada.mirgames.ru/omega.php              ////
////                                                                        ////
////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
////                                                                        ////
////  АВТОР: Andru 'aka' КЕМКА АНДРЕЙ                                       ////
////  Mail: Andru_@list.ru                                                  ////
////  Site: http://isada.mirgames.ru                                        ////
////                                                                        ////
////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
////                                                                        ////
////            Л И Ц Е Н З И О Н Н О Е  С О Г Л А Ш Е Н И Е :              ////
////                                                                        ////
////    Этот плагин абсолютный freeware + исходный код=) Никаких            ////
////  ограничений, ну а все лицензионные соглашения для движка надо         ////
////  соблюдать.                                                            ////
////                                                             (С)2006    ////
////                                                                        ////
////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
unit VL_Header;
interface

const
  VL_DLL = 'VL.dll';

//Инициализировать плагин. Обязательно вызвать после процедуры OE_Init до
//начала использования функций плагина
procedure VL_Init;
                                                                external VL_DLL;

//Рисует сгенерированную "сцену" освещения. Вызывать после отрисовки обьектов
procedure VL_Draw;
                                                                external VL_DLL;

//Добавить новый источник света в координатах X, Y с радиусом Radius и силой Power
//Функция возвращает идентификатор "источника света"
function  VL_AddLight( X, Y, Radius, Power : Integer ) : Integer;
                                                                external VL_DLL;
//Удалить "источник света" по идентификатору ID
procedure VL_FreeLight( ID : Integer );
                                                                external VL_DLL;

//Переместить "источник света" в координаты X, Y
//ID - идентификатор "источника света"
procedure VL_MoveLight( ID, X, Y : Integer );
                                                                external VL_DLL;
//Изменить размер "источника света" до Radius
//ID - идентификатор "источника света"
procedure VL_ResizeLight( ID, Radius : Integer );
                                                                external VL_DLL;

//Установить новую силу освещения для источника света ID
procedure VL_SetPower( ID, Power : Integer );
                                                                external VL_DLL;

implementation
end.
