////////////////////////////////////////////////////////////////////////////////
//                                                                            //
//                           O M E G A  E N G I N E                           //
//                                  D E M O                                   //
//                                                                            //
//    Простой пример демонстрирующий запуск движка, регистрации основных      //
//  процедур, создание таймеров и настройки основных параметров и отключение  //
//  выхода по нажатию Alt+F4(!)                                               //
//                                                                            //
//  (C)2006 Andru 'aka' KEMKA ANDREY.                                         //
//  web  : HTTP://isada.mirgames.ru                                           //
//  eMail: Andru_@list.ru                                                     //
//                                                                            //
////////////////////////////////////////////////////////////////////////////////
program Demo;

uses
  OMEGA in '..\..\..\headers\Delphi\OMEGA.pas',
  Unit1 in 'Unit1.pas';

// подключаем хедер движка

var
  // Таймеры. Можно обойтись и без дополнительных переменных, но для того чтоб
  // изменять во время работы приложения интервал и прочие параметры таймеров
  // надо иметь идентификатор на них.
  MyTimer1 : PTimer;
  MyTimer2 : PTimer;

procedure Load;
Begin
// Процедура зарегистрированная как SYS_FASTINIT предназначена для того чтоб
// быстро загрузить текстуру экрана загрузки и "нарисовать" ее, чтоб при выполнении
// Init пользователь не наблюдал свой рабочий стол.
End;

procedure Init;
Begin
// Init запускается сразу после Load и здесь уже можно загружать текстуры и прочее
End;

procedure Draw;
Begin
// Процедура назначенная как Draw будет вызываться столько сколько позволит
// мощность компьютера, а именно FPS-раз за секунду=)
End;

procedure Quit;
Begin
// Это процедура выхода, которая выполнится сразу после того как движок начнет
// завершать свою работу после вызова TestQuit
End;

procedure Timer1;
Begin
// Это первый назначенный таймер
End;

procedure Timer2;
Begin
// Это второй назначенный таймер, где будем обрабатывать клавиатуру
// По нажатию Escape выходим
if Key_Down( K_ESCAPE ) Then OE_Quit;
End;

begin

// Создаем первый таймер с интервалом 1000 и с обычной точностью. Назначаем
// процедуру Timer1
MyTimer1 := Timer_Create( @Timer1, 1000, 0 );
// Создаем второй таймер но с интервалом 10. Назначаем процедуру Timer2
MyTimer2 := Timer_Create( @Timer2, 10, 0 );

// Назначаем "системные" процедуры
OE_RegProcedure( SYS_FASTINIT, @Load ); // По сути экран загрузки
OE_RegProcedure( SYS_INIT,     @Init ); // Инициализация
OE_RegPRocedure( SYS_DRAW,     @Draw ); // Отрисовка
OE_RegPRocedure( SYS_QUIT,     @Quit ); // Ваш выход

// Устанавливаем настройки экрана
OE_SetScreenOptions( 800, 600, // Разрешение экрана или размер окна в оконном режиме
                     32,       // Количество бит на пиксель в полноэкранном режиме
                     0,        // Частота обновления экрана, 0 - по умолчанию
                     TRUE,     // Запуск в полноэкранном режиме
                     FALSE );  // Неиспользовать вертикальную синхронизацию

// Можно настроить дополнительные параметры движка
OE_SetAdvancedOptions( FALSE,   // По нажатию Alt+F4 приложение не завершит свою работу
                       FALSE ); // TRUE Только если вы используете свое окно для рендеринга
OE_ShowCursor( TRUE ); // Показать системный курсор

// И самое простое=) Запускаем движок
OE_Init;

end.

