////////////////////////////////////////////////////////////////////////////////
//                                                                            //
//                           O M E G A  E N G I N E                           //
//                                  D E M O                                   //
//                                                                            //
//    Простой пример демонстрирующий запуск движка, регистрации основных      //
//  процедур, создание таймеров и настройки основных параметров и отключение  //
//  выхода по нажатию Alt+F4(!)                                               //
//                                                                            //
//  (C)2006 Andru 'aka' KEMKA ANDREY.                                         //
//  web  : HTTP://isada.mirgames.ru                                           //
//  eMail: Andru_@list.ru                                                     //
//                                                                            //
////////////////////////////////////////////////////////////////////////////////

#include "..\..\..\headers\C++\OMEGA_code.cpp" // подключаем хедер движка
#include "..\..\..\headers\C++\OMEGA_functions.h" // для функций с параметрами поумолчанию

// Таймеры. Можно обойтись и без дополнительных переменных, но для того чтоб
// изменять во время работы приложения интервал и прочие параметры таймеров
// надо иметь идентификатор на них.
PTimer MyTimer1;
PTimer MyTimer2;

void Load()
{
// Процедура зарегистрированная как SYS_FASTINIT предназначена для того чтоб
// быстро загрузить текстуру экрана загрузки и "нарисовать" ее, чтоб при выполнении
// Init пользователь не наблюдал свой рабочий стол.
}

void Init()
{
// Init запускается сразу после Load и здесь уже можно загружать текстуры и прочее
}

void Draw()
{
// Процедура назначенная как Draw будет вызываться столько сколько позволит
// мощность компьютера, а именно FPS-раз за секунду=)
}

void Quit()
{
// Это процедура выхода, которая выполнится сразу после того как движок начнет
// завершать свою работу после вызова TestQuit
}

void Timer1()
{
// Это первый назначенный таймер
}

void Timer2()
{
// Это второй назначенный таймер, где будем обрабатывать клавиатуру
// По нажатию Escape выходим
if ( Key_Down( K_ESCAPE ) ) OE_Quit();
}

int main()
{

// Обязательно загружаем адреса функций!
LoadOMEGA();

// Создаем первый таймер с интервалом 1000 и с обычной точностью. Назначаем
// процедуру Timer1
MyTimer1 = Timer_Create( (void*)Timer1, 1000, 0 );
// Создаем второй таймер но с интервалом 10. Назначаем процедуру Timer2
MyTimer2 = Timer_Create( (void*)Timer2, 10, 0 );

// Назначаем "системные" процедуры
OE_RegProcedure( SYS_FASTINIT, (void*)Load ); // По сути экран загрузки
OE_RegProcedure( SYS_INIT,     (void*)Init ); // Инициализация
OE_RegProcedure( SYS_DRAW,     (void*)Draw ); // Отрисовка
OE_RegProcedure( SYS_QUIT,     (void*)Quit ); // Ваш выход

// Устанавливаем настройки экрана
OE_SetScreenOptions( 800, 600, // Разрешение экрана или размер окна в оконном режиме
                     32,       // Количество бит на пиксель в полноэкранном режиме
                     0,        // Частота обновления экрана, 0 - по умолчанию
                     true,     // Запуск в полноэкранном режиме
                     false );  // Неиспользовать вертикальную синхронизацию

// Можно настроить дополнительные параметры движка
OE_SetAdvancedOptions(
                       false,   // Не использовать системный лог
                       true,    // По нажатию Alt+F4 приложение не завершит свою работу
                       false ); // TRUE Только если вы используете свое окно для рендеринга
OE_ShowCursor( true ); // Показать системный курсор

// И самое простое=) Запускаем движок
OE_Init();

}

