////////////////////////////////////////////////////////////////////////////////
//                                                                            //
//                           O M E G A  E N G I N E                           //
//                                  D E M O                                   //
//                                                                            //
//    Простой пример демонстрирующий запуск движка, регистрации основных      //
//  процедур, создание таймеров и настройки основных параметров и отключение  //
//  выхода по нажатию Alt+F4(!)                                               //
//                                                                            //
//  (C)2006 Andru 'aka' KEMKA ANDREY.                                         //
//  web  : HTTP://isada.mirgames.ru                                           //
//  eMail: Andru_@list.ru                                                     //
//                                                                            //
////////////////////////////////////////////////////////////////////////////////
using System;
//using OMEGA;

namespace Demo
{
	class Class
	{
		static void Load()
		{
			// Процедура зарегистрированная как SYS_FASTINIT предназначена для того чтоб
			// быстро загрузить текстуру экрана загрузки и "нарисовать" ее, чтоб при выполнении
			// Init пользователь не наблюдал свой рабочий стол.
		}
		static void Init()
		{
			// Init запускается сразу после Load и здесь уже можно загружать текстуры и прочее
		}

		static void Draw()
		{
			// Процедура назначенная как Draw будет вызываться столько сколько позволит
			// мощность компьютера, а именно FPS-раз за секунду=)
		}
		
		static void Quit()
		{
			// Это процедура выхода, которая выполнится сразу после того как движок начнет
			// завершать свою работу после вызова TestQuit
		}

		static void Timer1()
		{
			// Это первый назначенный таймер
		}

		static void Timer2()
		{
			// Это второй назначенный таймер, где будем обрабатывать клавиатуру
			// По нажатию Escape выходим
			if ( Omega.Key.Down( Omega.K_ESCAPE ) ) Omega.Quit();
		}

		[STAThread]
		static void Main()
		{
			// Создаем первый таймер с интервалом 1000 и с обычной точностью. Назначаем
			// процедуру Timer1
			Omega.Timer_Create( new Omega.ProcAddr(Timer1), 1000, 0 );
			// Создаем второй таймер но с интервалом 10. Назначаем процедуру Timer2
			Omega.Timer_Create( new Omega.ProcAddr(Timer2), 10, 0 );
			
			// Назначаем "системные" процедуры
			Omega.RegProcedure( Omega.SYS_FASTINIT, new Omega.ProcAddr(Load) ); // По сути экран загрузки
			Omega.RegProcedure( Omega.SYS_INIT,     new Omega.ProcAddr(Init) ); // Инициализация
			Omega.RegProcedure( Omega.SYS_DRAW,     new Omega.ProcAddr(Draw) ); // Отрисовка
			Omega.RegProcedure( Omega.SYS_QUIT,     new Omega.ProcAddr(Quit) ); // Ваш выход
			
			// Устанавливаем настройки экрана
			Omega.SetScreenOptions( 800, 600, // Разрешение экрана или размер окна в оконном режиме
                     					32,       // Количество бит на пиксель в полноэкранном режиме
                     					0,        // Частота обновления экрана, 0 - по умолчанию
                     					true,     // Запуск в полноэкранном режиме
                     					false );  // Неиспользовать вертикальную синхронизацию

			// Можно настроить дополнительные параметры движка
			Omega.SetAdvancedOptions(
            				           false,   // Не использовать системный лог
									   false,    // По нажатию Alt+F4 приложение не завершит свою работу
									   false ); // TRUE Только если вы используете свое окно для рендеринга
			Omega.ShowCursor( true ); // Показать системный курсор			

			// И самое простое=) Запускаем движок
			Omega.Init();
		}
	}
}
